{
  "ETH": [
    {
      "title": "Ethereum Spot Order Activity Hints at Institutional Re-Entry, Analysts Claim",
      "link": "https://decrypt.co/348073/ethereum-spot-order-activity-institutional-re-entry&ved=2ahUKEwjqrvOK1OuQAxVxWXADHRjnLrkQxfQBegQIBRAC&usg=AOvVaw2mL7lkBKJ31Yeny6eu5oeD",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "On-chain data indicates that Ethereum whales are accumulating ETH, suggesting a potential local bottom ahead of the Fusaka upgrade. This activity hints at renewed institutional interest in Ethereum, which could enhance its outlook.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:21:34.608656+00:00"
    },
    {
      "title": "Better Crypto Buy: Bitcoin vs. Ethereum",
      "link": "https://www.fool.com/investing/2025/11/11/better-crypto-buy-bitcoin-vs-ethereum/&ved=2ahUKEwjqrvOK1OuQAxVxWXADHRjnLrkQxfQBegQIChAC&usg=AOvVaw0FD4Vtl9DMJCfNbb5Ogyf1",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "The article compares Bitcoin and Ethereum, highlighting Bitcoin's dominance and potential for higher returns. It suggests that while Ethereum has unique features, Bitcoin may be a safer investment due to its established market position. This could imply increased competition for Ethereum, potentially diminishing its pricing power and attractiveness to investors.",
      "sentiment": "negative",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:21:34.608656+00:00"
    },
    {
      "title": "BitMine Stock Rises After Tom Lee’s Firm Buys the Dip, Adding $389 Million in Ethereum",
      "link": "https://finance.yahoo.com/news/bitmine-stock-rises-tom-lee-162339360.html&ved=2ahUKEwjqrvOK1OuQAxVxWXADHRjnLrkQxfQBegQIBBAC&usg=AOvVaw3SmLnoKpEHuPxbG13XTAW4",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BitMine Immersion Technologies has increased its Ethereum holdings by 110,301 ETH, totaling $389 million, taking advantage of recent price dips. The firm now holds 2.9% of ETH's total supply and aims for 5%. Despite recent market weakness, BitMine's Chairman Tom Lee highlighted growing institutional interest in blockchain, suggesting a positive long-term outlook for Ethereum. However, ETH has seen a 15% decline recently, indicating short-term volatility.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:21:34.608656+00:00"
    }
  ],
  "SOL": [
    {
      "title": "Bitcoin is Flat, Ethereum Is Weak, and Solana Pops Big, While China and The White House Loom Large (BTC, ETH, SOL)",
      "link": "https://www.aol.com/articles/bitcoin-flat-ethereum-weak-solana-195142258.html",
      "snippet": "Bitcoin is Flat, Ethereum Is Weak, and Solana Pops Big, While China and The White House Loom Large (BTC, ETH, SOL) ... Solana SOL Cryptocurrency Physical Coin...",
      "date": "2025-11-11T19:21:38.779350+00:00",
      "published_at": "2025-11-11T19:21:38.779350+00:00",
      "raw_date": "8 hours ago",
      "source": "AOL.com",
      "summary": "Solana (SOL) has seen a 5% increase, outperforming Bitcoin and Ethereum, as it remains above its 200-day moving average. New ecosystem developments and increased on-chain activity, including the launch of platforms like pump.fun and bonk, are attracting traders. This positive momentum enhances Solana's outlook and competitive position in the cryptocurrency market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T03:21:59.730275+00:00"
    },
    {
      "title": "One Week After Staking ETFs, Solana Price Prediction is Weakening: Will $150 Hold?",
      "link": "https://finance.yahoo.com/news/one-week-staking-etfs-solana-105212815.html",
      "snippet": "During the last Solana boom, driven primarily by meme coins on Pump.fun, many thought SOL USDT would have already breached $500 and possibly even $1000 by...",
      "date": "2025-11-11T11:21:44.838340+00:00",
      "published_at": "2025-11-11T11:21:44.838340+00:00",
      "raw_date": "16 hours ago",
      "source": "Yahoo Finance",
      "summary": "Solana's price outlook is weakening, with predictions indicating struggles to maintain upward momentum. SOL has underperformed, down 21% year-to-date, and recently fell nearly 20%. Despite positive futures trading volume and institutional interest in newly launched spot Solana ETFs, the overall sentiment remains cautious. The potential for recovery hinges on increased institutional investment and meme coin activity, but current trends suggest a challenging environment for SOL investors.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:21:59.730275+00:00"
    },
    {
      "title": "Whales Inject $421 Million Into Solana as SOL’s Magical Target of $1,000 Emerges",
      "link": "https://zycrypto.com/whales-inject-421-million-into-solana-as-sols-magical-target-of-1000-emerges/",
      "snippet": "CoinShares' latest weekly report highlights a sharp split in crypto investor sentiment, whereby Solana (SOL) led inflows with $421.1 million.",
      "date": "2025-11-11T18:21:52.330315+00:00",
      "published_at": "2025-11-11T18:21:52.330315+00:00",
      "raw_date": "9 hours ago",
      "source": "ZyCrypto",
      "summary": "Solana (SOL) attracted $421.1 million in investments, leading digital assets despite overall market outflows. This surge indicates growing institutional confidence in SOL's blockchain and its expanding DeFi and NFT ecosystem. Additionally, Western Union plans to launch a stablecoin on Solana, enhancing its utility. Analysts highlight $200 as a crucial price point for potential bullish momentum, with a target of $1,000 emerging due to new ETFs. Overall, these developments suggest a positive outlook for SOL cryptocurrency.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T03:21:59.730275+00:00"
    }
  ],
  "XRP": [
    {
      "title": "Ripple Valuation Entwined with XRP Price Fluctuations",
      "link": "https://www.onesafe.io/blog/ripple-xrp-valuation-relationship-insights",
      "snippet": "In the bustling realm of digital currencies, the intricate relationship between Ripple and its cryptocurrency, XRP, continues to spark intense debate among...",
      "date": "2025-11-12T00:22:02.803686+00:00",
      "published_at": "2025-11-12T00:22:02.803686+00:00",
      "raw_date": "3 hours ago",
      "source": "OneSafe",
      "summary": "Ripple's valuation is closely tied to XRP's price, with potential for significant increases as institutional investment grows and regulatory changes enhance transparency. The favorable ruling against the SEC has boosted market optimism, positioning XRP as a key asset in the expanding B2B payments sector. Analysts predict XRP's price could soar based on adoption and utility, suggesting a bullish outlook for investors. However, Ripple's future remains uncertain amid evolving regulations and market dynamics.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:22:21.710358+00:00"
    },
    {
      "title": "Prediction: XRP Price Will Soar Over The Next Year -- But Will It Last?",
      "link": "https://www.aol.com/finance/prediction-xrp-price-soar-over-180000712.html",
      "snippet": "Ripple's national bank charter pursuit has created short-term momentum, but long-term fundamentals remain shaky. Ripple's RLUSD could cannibalize XRP's role...",
      "date": "2025-11-12T00:22:08.803719+00:00",
      "published_at": "2025-11-12T00:22:08.803719+00:00",
      "raw_date": "3 hours ago",
      "source": "AOL.com",
      "summary": "XRP's price may rise in the short term due to Ripple's pursuit of a national bank charter, but long-term fundamentals are concerning. The introduction of Ripple's stablecoin RLUSD could diminish XRP's role as a bridge asset, limiting demand. While banking adoption is crucial for XRP's success, larger banks have not widely adopted it, raising doubts about its future profitability. Overall, the outlook for XRP appears uncertain.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:22:21.710358+00:00"
    },
    {
      "title": "More surprising news on Veterans day sends Bitcoin, XRP reeling",
      "link": "https://www.thestreet.com/crypto/markets/more-surprising-news-veterans-day-sends-bitcoin-xrp-reeling",
      "snippet": "Bitcoin (BTC) and XRP led a fresh downturn across the crypto market on Veterens Day Nov. 11, as investors reacted to renewed tariff headlines from former...",
      "date": "2025-11-11T23:22:14.219462+00:00",
      "published_at": "2025-11-11T23:22:14.219462+00:00",
      "raw_date": "4 hours ago",
      "source": "TheStreet",
      "summary": "On Veterans Day, unexpected news caused a decline in both Bitcoin and XRP, indicating potential volatility and uncertainty in the cryptocurrency market.",
      "sentiment": "negative",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:22:21.710358+00:00"
    }
  ],
  "BTC": [
    {
      "title": "China Accuses US Of $13 Billion Bitcoin 'State-Backed Crypto Heist'",
      "link": "https://finance.yahoo.com/news/china-accuses-us-13-billion-193107770.html",
      "snippet": "China has accused the U.S. of taking $13 billion in Bitcoin (CRYPTO: BTC) linked to a 2020 hack, escalating a cross-border dispute that Washington says is...",
      "date": "2025-11-11T19:22:26.984868+00:00",
      "published_at": "2025-11-11T19:22:26.984868+00:00",
      "raw_date": "8 hours ago",
      "source": "Yahoo Finance",
      "summary": "China has accused the U.S. of a $13 billion Bitcoin seizure linked to a 2020 hack, escalating tensions over digital assets. This accusation may undermine BTC's credibility and pricing power as geopolitical disputes intensify. The U.S. maintains that the seizure was lawful, but the ongoing conflict could negatively impact BTC's market perception and investor confidence. Technical analysis shows BTC is range-bound with resistance levels that could hinder upward movement.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:22:47.914659+00:00"
    },
    {
      "title": "China Accuses US of Orchestrating $13 Billion Bitcoin Hack",
      "link": "https://www.bloomberg.com/news/articles/2025-11-11/china-accuses-us-of-orchestrating-13-billion-bitcoin-hack",
      "snippet": "China's cybersecurity agency accused the American government of orchestrating the theft of about $13 billion worth of Bitcoin, representing China's most...",
      "date": "2025-11-11T19:22:34.582208+00:00",
      "published_at": "2025-11-11T19:22:34.582208+00:00",
      "raw_date": "8 hours ago",
      "source": "Bloomberg.com",
      "summary": "China's cybersecurity agency accused the US of orchestrating a $13 billion Bitcoin theft, attributing the hack to a state-level operation. This claim highlights geopolitical tensions and raises concerns about the security of Bitcoin, potentially impacting investor confidence in BTC cryptocurrency.",
      "sentiment": "negative",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:22:47.914659+00:00"
    },
    {
      "title": "Bitcoin Analysis: The Cryptocurrency Pulls Back, Erasing Last Week’s Gains",
      "link": "https://www.forex.com/en-us/news-and-analysis/bitcoin-analysisthe-cryptocurrency-pulls-back-erasing-last-weeks-gains/?amp=true",
      "snippet": "Although Bitcoin seemed poised to start the week with confidence, a consistent selling bias has returned, with the cryptocurrency now posting a decline of...",
      "date": "2025-11-11T22:22:41.385003+00:00",
      "published_at": "2025-11-11T22:22:41.385003+00:00",
      "raw_date": "5 hours ago",
      "source": "FOREX.com",
      "summary": "Bitcoin has experienced a decline of over 3%, driven by sustained selling pressure and capital outflows exceeding $500 million. Despite a slight recovery in market sentiment, Bitcoin's price remains weak, with reduced institutional interest and a drop in Open Interest. This trend suggests a loss of attractiveness for BTC as investors shift towards traditional assets and altcoins, potentially diminishing Bitcoin's dominance and increasing selling pressure in the short term.",
      "sentiment": "negative",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T03:22:47.914659+00:00"
    }
  ],
  "DOGE": [
    {
      "title": "BTC, LTC, ETH, and DOGE Earnings: 9 Trusted Cloud Mining Sites Review",
      "link": "https://www.cryptoninjas.net/news/btc-ltc-eth-and-doge-earnings-9-trusted-cloud-mining-sites-review/",
      "snippet": "On September 24, the overall crypto market cap dropped to $3.87, taking significant liquidations with it. With top cryptocurrencies including BTC, ETH,...",
      "date": "2025-11-11T15:22:50.404221+00:00",
      "published_at": "2025-11-11T15:22:50.404221+00:00",
      "raw_date": "12 hours ago",
      "source": "CryptoNinjas",
      "summary": "The article reviews nine trusted cloud mining sites, including DOGE, highlighting FY Energy as a top choice due to its green energy focus and daily earnings potential. This could enhance DOGE's appeal among investors seeking sustainable mining options.",
      "sentiment": "positive",
      "sentiment_confidence": 0.7,
      "fetched_at": "2025-11-12T03:23:11.674173+00:00"
    },
    {
      "title": "Dogecoin Could “Totally Go Burst” As This DOGE Competitor Emerges As The Next Crypto To Explode",
      "link": "https://www.cryptopolitan.com/dogecoin-could-totally-go-burst-as-this-doge-competitor-emerges-as-the-next-crypto-to-explode/",
      "snippet": "The cryptocurrency markets have been facing very tumultuous times, exemplified in the meme coins such as Dogecoin (DOGE), which have faced extreme.",
      "date": "2025-11-11T20:22:57.881081+00:00",
      "published_at": "2025-11-11T20:22:57.881081+00:00",
      "raw_date": "7 hours ago",
      "source": "Cryptopolitan",
      "summary": "The emergence of a new competitor to Dogecoin raises concerns about its future, with predictions that DOGE could face significant challenges. This development suggests a potential decrease in DOGE's market position and pricing power, which could negatively impact investor sentiment.",
      "sentiment": "negative",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T03:23:11.674173+00:00"
    },
    {
      "title": "Dogecoin (DOGE) Price Prediction: Dogecoin’s Chart Flashes Bullish Momentum Toward $0.40–$1.00 Levels",
      "link": "https://bravenewcoin.com/insights/dogecoin-doge-price-prediction-dogecoins-chart-flashes-bullish-momentum-toward-0-40-1-00-levels",
      "snippet": "Dogecoin (DOGE) is making waves in the crypto market as technical patterns hint at a potential rally toward $0.40–$1.00, capturing the attention of traders...",
      "date": "2025-11-11T21:23:04.228611+00:00",
      "published_at": "2025-11-11T21:23:04.228611+00:00",
      "raw_date": "6 hours ago",
      "source": "Brave New Coin",
      "summary": "Dogecoin (DOGE) is showing bullish momentum, with price predictions suggesting it could reach between $0.40 and $1.00. This positive outlook may enhance investor confidence and profitability for DOGE cryptocurrency.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T03:23:11.674173+00:00"
    }
  ],
  "BNB": [
    {
      "title": "BNB Taps Argentina To Don Crypto Crown: Brazil Crypto Ambitions Falter on Slow Regulation",
      "link": "https://99bitcoins.com/news/altcoins/bnb-taps-argentina-to-don-crypto-crown-brazil-crypto-ambitions-falter-on-slow-regulation/&ved=2ahUKEwjrqprH1OuQAxUcSGwGHfhpI34QxfQBegQIARAC&usg=AOvVaw2sP5oET88xmbHA1AzmgFOn",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BNB cryptocurrency is gaining traction in Argentina as it aims to establish a stronger presence in the Latin American market, while Brazil's crypto ambitions are hindered by slow regulatory progress. This development could enhance BNB's competitive advantage in the region.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:23:39.026147+00:00"
    },
    {
      "title": "Binance Lists Allora (ALLO) as 58th HODLer Airdrop with 15M Tokens Backing BNB Earn Subscriptions",
      "link": "https://www.cryptoninjas.net/news/binance-lists-allora-allo-as-58th-hodler-airdrop-with-15m-tokens-backing-bnb-earn-subscriptions/&ved=2ahUKEwjrqprH1OuQAxUcSGwGHfhpI34QxfQBegQIBhAC&usg=AOvVaw29sFMRqvPjAiuZNLj6e_Iz",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Binance has introduced Allora (ALLO) as its 58th HODLer Airdrop, which includes 15 million tokens supporting BNB Earn subscriptions. This move could enhance BNB's utility and attractiveness to investors, potentially boosting its market position.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T03:23:39.026147+00:00"
    },
    {
      "title": "Moomoo Launches BNB Trading for U.S. and Singapore Users on Platform",
      "link": "https://coincentral.com/moomoo-launches-bnb-trading-for-u-s-and-singapore-users-on-platform/&ved=2ahUKEwjrqprH1OuQAxUcSGwGHfhpI34QxfQBegQIChAC&usg=AOvVaw1iQuIRWBxPIX6nY5EcIYrr",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Moomoo has introduced BNB trading for users in the U.S. and Singapore, potentially increasing accessibility and demand for the cryptocurrency. This development could enhance BNB's market presence and attractiveness to investors.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T03:23:39.026147+00:00"
    }
  ],
  "_metadata": {
    "last_refresh_at": "2025-11-12T10:30:16.132719+00:00"
  },
  "BBCA": [
    {
      "title": "Profil Timothy Ronald, Investor Muda Asal Indonesia yang Borong Saham BBCA",
      "link": "https://www.marketeers.com/timothy-ronald-investor-muda-indonesia-yang-borong-saham-bbca/&ved=2ahUKEwiWg8r4suyQAxWGXGwGHY6SJLgQxfQBegQIAhAC&usg=AOvVaw1nuVSf5tdfAzEpUh5NLkVh",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Timothy Ronald, a young Indonesian investor, has significantly increased his holdings in BBCA, indicating strong confidence in the company's future prospects. His investment strategy highlights a positive outlook for BBCA amidst a competitive market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:25:55.012463+00:00"
    },
    {
      "title": "Harga Saham BBCA Anjlok Terus Hingga Sentuh Level Terendah Tiga Tahun",
      "link": "https://insight.kontan.co.id/news/harga-saham-bbca-anjlok-terus-hingga-sentuh-level-terendah-tiga-tahun&ved=2ahUKEwiWg8r4suyQAxWGXGwGHY6SJLgQxfQBegQIBxAC&usg=AOvVaw0Kegwb5NgkyybPrN0oabZ0",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BBCA's stock continues to decline, reaching a three-year low, despite solid fundamentals. Foreign ownership has decreased from 35.86% in January 2025 to 33.24% by September 2025, with foreign investors recording a net sell of Rp 32.38 trillion year-to-date as of October 15.",
      "sentiment": "negative",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:25:55.012463+00:00"
    },
    {
      "title": "BBCA Klarifikasi Isu Akuisisi Rp5 Triliun & Utang Rp60 Triliun ke Negara yang Heboh di Media",
      "link": "https://www.bareksa.com/berita/saham/2025-08-20/bbca-klarifikasi-isu-akuisisi-rp5-triliun-utang-rp60-triliun-ke-negara-yang-heboh-di-media&ved=2ahUKEwiWg8r4suyQAxWGXGwGHY6SJLgQxfQBegQIChAC&usg=AOvVaw1LkXVUHYvQoaOQ2-KSkhfh",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BBCA Indonesia addressed recent media speculation regarding a potential Rp5 trillion acquisition and a Rp60 trillion debt to the government. The company clarified that these issues are not as reported, aiming to reassure investors about its financial stability and strategic direction.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T10:25:55.012463+00:00"
    }
  ],
  "GOTO": [
    {
      "title": "Roller Coaster Saham GOTO: Untung Rugi Beda Cerita, Drama Sama",
      "link": "https://www.cnbcindonesia.com/research/20251110131830-128-683825/roller-coaster-saham-goto-untung-rugi-beda-cerita-drama-sama&ved=2ahUKEwj5lauFs-yQAxUOWXADHdgBM2UQxfQBegQICRAC&usg=AOvVaw3YTevXJO6v3s5B98wXPrcI",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "The article discusses the volatile performance of GOTO Indonesia's stock, highlighting contrasting narratives of profit and loss. It reflects on the company's challenges and market dynamics, suggesting a complex outlook for investors.",
      "sentiment": "neutral",
      "sentiment_confidence": 0.7,
      "fetched_at": "2025-11-12T10:26:13.221396+00:00"
    },
    {
      "title": "Mengapa Saham GoTo Naik Mendadak",
      "link": "https://www.tempo.co/ekonomi/naik-turun-saham-goto-2087783&ved=2ahUKEwj5lauFs-yQAxUOWXADHdgBM2UQxfQBegQIARAC&usg=AOvVaw19WadGjpyxaDqYyFo6QmQw",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Saham GoTo Indonesia mengalami kenaikan mendadak, dipicu oleh faktor-faktor positif yang meningkatkan kepercayaan investor terhadap prospek perusahaan. Kenaikan ini menunjukkan potensi pertumbuhan dan daya tarik yang lebih besar di pasar.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:26:13.221396+00:00"
    },
    {
      "title": "Soal Merger GOTO-Grab, Bos Danantara Sebut Hal Terpenting",
      "link": "https://www.cnbcindonesia.com/market/20251111124310-17-684204/soal-merger-goto-grab-bos-danantara-sebut-hal-terpenting&ved=2ahUKEwj5lauFs-yQAxUOWXADHdgBM2UQxfQBegQIChAC&usg=AOvVaw1ChdwGPQhyh19aBi6mxn82",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "The CEO of Danantara commented on the potential merger between GOTO and Grab, emphasizing key factors that could influence the outcome. This development may impact GOTO's competitive positioning in the market.",
      "sentiment": "neutral",
      "sentiment_confidence": 0.7,
      "fetched_at": "2025-11-12T10:26:13.221396+00:00"
    }
  ],
  "BYAN": [
    {
      "title": "2 Saham Milik Low Tuck Kwong di Bursa Efek Indonesia, Intip Profil dan Kinerjanya",
      "link": "https://m.rctiplus.com/news/detail/ekonomi/5250077/2-saham-milik-low-tuck-kwong-di-bursa-efek-indonesia-intip-profil-dan-kinerjanya&ved=2ahUKEwjJ0LOPs-yQAxUTUGwGHdSJAVsQxfQBegQIAxAC&usg=AOvVaw2pSqagxpBIfdK6gFU3UKoR",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Low Tuck Kwong, founder of PT Bayan Resources Tbk (BYAN), holds 40.23% of the company's shares. BYAN, a low-cost coal mining firm, has seen its stock price decline by 12.21% in 2025. The article highlights Kwong's significant stake and the company's operations in East and South Kalimantan, but also notes the recent drop in share price, indicating potential challenges ahead for BYAN.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:26:41.896206+00:00"
    },
    {
      "title": "Bos Bayan Buka-bukaan Tantangan Industri Batu Bara di 2025",
      "link": "https://www.cnbcindonesia.com/news/20250310164003-4-617318/bos-bayan-buka-bukaan-tantangan-industri-batu-bara-di-2025&ved=2ahUKEwjJ0LOPs-yQAxUTUGwGHdSJAVsQxfQBegQIBxAC&usg=AOvVaw1i5J-xUWZ7GsqLep4qAA2U",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Bos Bayan discusses the challenges facing the coal industry in 2025, highlighting potential risks that could impact BYAN Indonesia's market position and profitability. The focus on industry challenges suggests a cautious outlook for investors in BYAN Indonesia.",
      "sentiment": "negative",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T10:26:41.896206+00:00"
    },
    {
      "title": "Laba Bersih Bayan Resources (BYAN) Menyusut 7,30% pada Semester I-2025",
      "link": "https://investasi.kontan.co.id/news/laba-bersih-bayan-resources-byan-menyusut-730-pada-semester-i-2025&ved=2ahUKEwjJ0LOPs-yQAxUTUGwGHdSJAVsQxfQBegQIChAC&usg=AOvVaw0U-jkSZxEo14mcQm8MxrmP",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Bayan Resources (BYAN) reported a 7.30% decline in net profit for the first half of 2025, indicating potential challenges in maintaining profitability.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:26:41.896206+00:00"
    }
  ],
  "BMRI": [
    {
      "title": "Ekonom Bank Mandiri (BMRI) Ingatkan Aliran Dana Asing ke Indonesia Masih Hadapi Tantangan, Mengapa?",
      "link": "https://swa.co.id/read/465944/ekonom-bank-mandiri-bmri-ingatkan-aliran-dana-asing-ke-indonesia-masih-hadapi-tantangan-mengapa&ved=2ahUKEwjW0_Gbs-yQAxWRZWwGHS3BNz4QxfQBegQIBBAC&usg=AOvVaw1wIEHYv_TStHAOE8Uq1Kbw",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Bank Mandiri (BMRI) acknowledges ongoing challenges for foreign capital inflows into Indonesia, which could impact its growth and profitability. The bank's outlook may be affected by external economic factors that could diminish its competitive position.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:27:09.639675+00:00"
    },
    {
      "title": "Perkuat Inklusi Keuangan, Bank Mandiri Gandeng IKA UII Terbitkan Kartu Debit Co-Brand GPN",
      "link": "https://www.metrotvnews.com/read/NleC8DZw-perkuat-inklusi-keuangan-bank-mandiri-gandeng-ika-uii-terbitkan-kartu-debit-co-brand-gpn&ved=2ahUKEwjW0_Gbs-yQAxWRZWwGHS3BNz4QxfQBegQIBxAC&usg=AOvVaw36shIbCMLNQjGh0fjRlE1E",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Bank Mandiri has strengthened its strategic collaboration with IKA UII by launching a Co-Brand Debit Card, enhancing financial inclusion and digital services for alumni. This initiative, part of a five-year partnership, aims to improve financial literacy and streamline transactions through integrated services. The move is expected to bolster Bank Mandiri's competitive advantage in the digital banking space, benefiting both the bank and its alumni network.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:27:09.639675+00:00"
    },
    {
      "title": "Bank Mandiri Tanggapi Kabar Pelepasan Saham BSI",
      "link": "https://insight.kontan.co.id/news/bank-mandiri-tanggapi-kabar-pelepasan-saham-bsi&ved=2ahUKEwjW0_Gbs-yQAxWRZWwGHS3BNz4QxfQBegQIChAC&usg=AOvVaw0wVSohjDSyrt25AnEluUaN",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Bank Mandiri (BMRI) has clarified that there are no plans to divest shares in PT Bank Syariah Indonesia Tbk (BSI) as part of its 2025 Business Plan. This statement reinforces BMRI's commitment to good corporate governance and transparency, which may enhance investor confidence.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:27:09.639675+00:00"
    }
  ],
  "BBRI": [
    {
      "title": "BERITA POPULER: Pembaruan Valuasi dan Target Harga BBRI hingga Teka-teki Investor CBRE",
      "link": "https://investor.id/market/416875/berita-populer-pembaruan-valuasi-dan-target-harga-bbri-hingga-tekateki-investor-cbre&ved=2ahUKEwj43bWqs-yQAxV4R2wGHSaZAA8QxfQBegQIAxAC&usg=AOvVaw32kkS5XKeHXmcoEUcqZs4f",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BBRI's valuation has been updated with a new target price reflecting stronger credit growth projections for 2026, which is expected to offset potential declines in interest margins. This positive outlook enhances BBRI's profitability and competitive position in the market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:27:41.170467+00:00"
    },
    {
      "title": "Goldman Sachs dan Vanguard Borong Saham BBRI - Market",
      "link": "https://www.bloombergtechnoz.com/detail-news/87215/goldman-sachs-dan-vanguard-borong-saham-bbri&ved=2ahUKEwj43bWqs-yQAxV4R2wGHSaZAA8QxfQBegQIARAC&usg=AOvVaw1ybNva4KgxUosu7kh528PP",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Goldman Sachs and Vanguard have significantly increased their stakes in PT Bank Rakyat Indonesia Tbk (BBRI), purchasing millions of shares amid a perceived undervaluation. This buying activity, alongside other investors like Invesco and Manulife, suggests strong institutional confidence in BBRI's future prospects, enhancing its market outlook.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:27:41.170467+00:00"
    },
    {
      "title": "Setelah Jadi Jawara Top Leaders LQ45, Kini Ratusan Juta Saham BBRI Dilego JP Morgan",
      "link": "https://insight.kontan.co.id/news/setelah-jadi-jawara-top-leaders-lq45-kini-ratusan-juta-saham-bbri-dilego-jp-morgan&ved=2ahUKEwj43bWqs-yQAxV4R2wGHSaZAA8QxfQBegQIChAC&usg=AOvVaw20c25T-xjxuslwWWSg8hjO",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Bank Rakyat Indonesia Tbk (BBRI) shares fell 1.94% to IDR 4,040 due to JP Morgan selling 378.64 million shares. This selling pressure from a major institutional investor raises concerns about BBRI's stock stability and investor confidence, despite JP Morgan retaining a significant stake.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:27:41.170467+00:00"
    }
  ],
  "TLKM": [
    {
      "title": "TELKOMIndonesia company news",
      "link": "/search?sca_esv=b51b2d73c9f7d5a8&hl=id-ID&gl=ID&tbm=nws&q=TELKOM+Indonesia+company+news&spell=1&sa=X&ved=2ahUKEwiTzLW5s-yQAxUTSGwGHafrMxEQBXoECAsQAQ",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "The article discusses recent developments regarding TELKOM Indonesia (TLKM), highlighting its strategic initiatives and market performance. It notes improvements in service offerings and customer satisfaction, which could enhance profitability and competitive positioning in the telecommunications sector.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:28:02.923036+00:00"
    },
    {
      "title": "Telkom Indonesia Kembali Masuk Daftar LinkedIn Top Companies 2025",
      "link": "https://www.telkom.co.id/sites/berita/id_ID/news/telkom-indonesia-kembali-masuk-daftar-linkedin-top-companies-2025-2965&ved=2ahUKEwiTzLW5s-yQAxUTSGwGHafrMxEQxfQBegQIAhAC&usg=AOvVaw1k9Ox2raSJkBQ-CkpRNsmi",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Telkom Indonesia has been recognized in the LinkedIn Top Companies 2025 list, highlighting its strong employer brand and positive workplace culture. This recognition may enhance its reputation and attractiveness to talent, potentially benefiting its operational performance and competitive position.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:28:02.923036+00:00"
    },
    {
      "title": "Saham TLKM Tetap di Atas 3.000 di Tengah Jual-Beli oleh JP Morgan & Credit Agricole",
      "link": "https://insight.kontan.co.id/news/saham-tlkm-tetap-di-atas-3000-di-tengah-jual-beli-oleh-jp-morgan-credit-agricole&ved=2ahUKEwiTzLW5s-yQAxUTSGwGHafrMxEQxfQBegQIBRAC&usg=AOvVaw1tDAnjZSHmwnnVo-fQv1ib",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Telkom Indonesia (TLKM) shares have remained above Rp 3,000 since August 12, 2025, peaking at Rp 3,490 on August 14, 2025. Despite this high, the stock has shown sideways movement as institutional foreign investors adjust their holdings in the company.",
      "sentiment": "neutral",
      "sentiment_confidence": 0.7,
      "fetched_at": "2025-11-12T10:28:02.923036+00:00"
    }
  ],
  "ASII": [
    {
      "title": "Saham ASII Tetap Jadi Proksi Pasar Saham Indonesia, Asing Terus Borong sahamnya",
      "link": "https://insight.kontan.co.id/news/saham-asii-tetap-jadi-proksi-pasar-saham-indonesia-asing-terus-borong-sahamnya&ved=2ahUKEwjYj-DDs-yQAxVOTGwGHasnMukQxfQBegQIARAC&usg=AOvVaw2YFPpko9NnxdIwxExqKy4y",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Astra International Tbk (ASII) remains a key indicator for the Indonesian stock market, despite ranking 11th in market capitalization. As of May 2025, ASII's market cap is Rp 196.34 trillion, and foreign investors continue to buy its shares, indicating strong investor confidence.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:28:32.781647+00:00"
    },
    {
      "title": "Sinyal Akuisisi Astra (ASII), Kaji Ulang Semua Portofolio Bisnis",
      "link": "https://www.bloombergtechnoz.com/detail-news/82015/sinyal-akuisisi-astra-asii-kaji-ulang-semua-portofolio-bisnis&ved=2ahUKEwjYj-DDs-yQAxVOTGwGHasnMukQxfQBegQIBRAC&usg=AOvVaw3nVZALSeHsvzs-tFh3nlct",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Astra International Tbk (ASII) is conducting a strategic review of its entire business portfolio in response to global and domestic economic pressures. The company aims to identify promising business areas for the future. Despite not providing quantitative projections, ASII's leadership remains optimistic about 2026, relying on improved global economic conditions and a recovery in the automotive market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T10:28:32.781647+00:00"
    },
    {
      "title": "Kian Agresif! Astra Group (ASII) Kembali Jaring 10 Juta Saham HEAL",
      "link": "https://emitennews.com/news/kian-agresif-astra-group-asii-kembali-jaring-10-juta-saham-heal&ved=2ahUKEwjYj-DDs-yQAxVOTGwGHasnMukQxfQBegQICRAC&usg=AOvVaw3Zw4ORLD_rKuvOsJSs5ufl",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Astra Group (ASII) has successfully acquired 10 million shares of HEAL, indicating a strategic move to strengthen its investment portfolio. This acquisition could enhance ASII's market position and profitability, reflecting positively on its outlook.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:28:32.781647+00:00"
    }
  ],
  "TPIA": [
    {
      "title": "Indonesia’s Chandra Asri Signs Deal to Buy Esso Fuel Stations in Singapore",
      "link": "https://rri.co.id/en/business/1923858/indonesia-s-chandra-asri-signs-deal-to-buy-esso-fuel-stations-in-singapore&ved=2ahUKEwj65vXQs-yQAxVYWGwGHbu1J84QxfQBegQIARAC&usg=AOvVaw2aT7-aBmo75Iy2TKog_JYx",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Chandra Asri Pacific Tbk (TPIA) has signed an agreement to acquire ExxonMobil's Esso-branded retail fuel network in Singapore, enhancing its strategy for integrated energy infrastructure in Southeast Asia. This acquisition aligns with TPIA's growth objectives and is expected to strengthen its competitive position in the region. The company reported a significant profit increase in the first half of 2025, further supporting its positive outlook.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:28:59.345656+00:00"
    },
    {
      "title": "Saham Orang Terkaya Indonesia Mulai Naik Usai Sebulan Melemah, Saatnya Beli / Jual?",
      "link": "https://investasi.kontan.co.id/news/saham-orang-terkaya-indonesia-mulai-naik-usai-sebulan-melemah-saatnya-beli-jual&ved=2ahUKEwj65vXQs-yQAxVYWGwGHbu1J84QxfQBegQIBhAC&usg=AOvVaw2PKvC40cVngvzIKxdrYkVN",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "The article discusses the recent rise in shares of Indonesia's wealthiest individuals after a month of decline, suggesting a potential buying opportunity. However, it does not specifically address TPIA Indonesia or its market position, leaving the relevance to TPIA unclear.",
      "sentiment": "neutral",
      "sentiment_confidence": 0.5,
      "fetched_at": "2025-11-12T10:28:59.345656+00:00"
    },
    {
      "title": "Pefindo Ungkap Peringkat Emiten Prajogo (TPIA)",
      "link": "https://www.emitennews.com/news/pefindo-ungkap-peringkat-emiten-prajogo-tpia&ved=2ahUKEwj65vXQs-yQAxVYWGwGHbu1J84QxfQBegQIChAC&usg=AOvVaw2Zod29FkZFmBn8oWSkLOTh",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Pefindo has released a rating for Prajogo (TPIA), indicating its financial standing and creditworthiness. This rating can influence investor confidence and market perception of TPIA's stability and growth potential.",
      "sentiment": "neutral",
      "sentiment_confidence": 0.7,
      "fetched_at": "2025-11-12T10:28:59.345656+00:00"
    }
  ],
  "BBNI": [
    {
      "title": "BNI Strengthens Strategic Role in Sustainable Financing for a Green Future",
      "link": "https://www.bni.co.id/en-us/home/bni-news/news/articleid/25021/bni-strengthens-strategic-role-in-sustainable-financing-for-a-green-future&ved=2ahUKEwiGv_Lds-yQAxXSUGwGHdPKIA8QxfQBegQICRAC&usg=AOvVaw2Smo2xVkML4qDc_H_rQw-x",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BNI Indonesia is enhancing its strategic role in sustainable financing, focusing on initiatives that promote a green future. This development is expected to improve the company's outlook and profitability by aligning with global sustainability trends.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:29:28.363848+00:00"
    },
    {
      "title": "BNI (BBNI) Gandeng KPK Perkuat Penerapan Tata Kelolaan Perusahaan yang Baik",
      "link": "https://mediaasuransinews.co.id/news-in-brief/bni-bbni-gandeng-kpk-perkuat-penerapan-tata-kelolaan-perusahaan-yang-baik/&ved=2ahUKEwiGv_Lds-yQAxXSUGwGHdPKIA8QxfQBegQICBAC&usg=AOvVaw3UKv5VZY_EicBEp7PNQonD",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BNI (BBNI) has partnered with the Corruption Eradication Commission (KPK) to enhance corporate governance practices. This collaboration aims to strengthen BNI's operational integrity and transparency, potentially improving its competitive position in the banking sector.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:29:28.363848+00:00"
    },
    {
      "title": "RUPST BNI 2025 bahas laba, dividen, buyback, hingga pergantian direksi",
      "link": "https://www.antaranews.com/berita/4737101/rupst-bni-2025-bahas-laba-dividen-buyback-hingga-pergantian-direksi&ved=2ahUKEwiGv_Lds-yQAxXSUGwGHdPKIA8QxfQBegQIChAC&usg=AOvVaw20mtsZvVtThtPmIhBJpnWt",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "BNI's Annual General Meeting (RUPST) on March 26, 2025, will address key topics including profit distribution, dividend increases, and a share buyback plan. BNI reported a net profit of Rp21.5 trillion for 2024, a 2.87% increase, driven by digital transformation. The bank plans to raise its dividend payout ratio to 55-60%. These developments reflect BNI's strong financial performance and commitment to supporting Indonesia's economy, enhancing its competitive position.",
      "sentiment": "positive",
      "sentiment_confidence": 0.9,
      "fetched_at": "2025-11-12T10:29:28.363848+00:00"
    }
  ],
  "UNVR": [
    {
      "title": "Pendapatan dan Laba Unilever Indonesia (UNVR) Merosot Pada Semester I-2025",
      "link": "https://insight.kontan.co.id/news/pendapatan-dan-laba-unilever-indonesia-unvr-merosot-pada-semester-i-2025&ved=2ahUKEwji_Jzrs-yQAxVDSmwGHf2oEvoQxfQBegQIAxAC&usg=AOvVaw09fkncALDMtb2kMZGmuLzP",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Unilever Indonesia (UNVR) reported a 4.4% year-on-year decline in net sales to Rp 18.2 trillion for the first half of 2025, though this reflects a 13.1% increase compared to the second half of 2024. The mixed performance raises concerns about its competitive position and pricing power.",
      "sentiment": "negative",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:29:53.527165+00:00"
    },
    {
      "title": "Unilever angkat Hendri Widiarta jadi direktur baru lewat RUPSLB",
      "link": "https://www.antaranews.com/berita/5175305/unilever-angkat-hendri-widiarta-jadi-direktur-baru-lewat-rupslb&ved=2ahUKEwji_Jzrs-yQAxVDSmwGHf2oEvoQxfQBegQIBhAC&usg=AOvVaw1k1qXkh-Pfy4FTnfVSKpsE",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "PT Unilever Indonesia Tbk (UNVR) has appointed Hendri Widiarta as a new director, effective October 15, 2025, following Willy Saelan's resignation. Hendri brings over 28 years of HR leadership experience, which is expected to enhance UNVR's capabilities and drive organizational transformation. The management believes this change will foster innovation and sustainable growth for the company.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:29:53.527165+00:00"
    },
    {
      "title": "RUPSLB & RUPS Independen Unilever Indonesia Setujui Divestasi Bisnis Es Krim",
      "link": "https://www.unilever.co.id/news/press-releases/2025/rupslb-rups-independen-unilever-indonesia-setujui-divestasi-bisnis-es-krim/&ved=2ahUKEwji_Jzrs-yQAxVDSmwGHf2oEvoQxfQBegQIChAC&usg=AOvVaw2qN9mK5ZQtza-pmkA5BvHQ",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "Unilever Indonesia's recent shareholder meetings approved the divestment of its ice cream business. This strategic move may allow the company to focus on core operations and enhance profitability, potentially improving its competitive position in the market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T10:29:53.527165+00:00"
    }
  ],
  "HMSP": [
    {
      "title": "HM Sampoerna (HMSP) Gandeng Lima BUMN Perkuat Bisnis SRC",
      "link": "https://insight.kontan.co.id/news/hm-sampoerna-hmsp-gandeng-lima-bumn-perkuat-bisnis-src&ved=2ahUKEwiN1IH3s-yQAxURTWwGHW5SOhAQxfQBegQICRAC&usg=AOvVaw0WqhmIX5qyv4X6Zty5PlI9",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "HM Sampoerna (HMSP) has partnered with five state-owned enterprises to enhance its Sampoerna Retail Community (SRC), which includes over 250,000 members across Indonesia. This strategic collaboration aims to strengthen HMSP's business ecosystem, potentially improving its market position and profitability.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:30:16.132697+00:00"
    },
    {
      "title": "Induk Usaha HMSP Komitmen Investasi Jangka Panjang di Indonesia",
      "link": "https://money.kompas.com/read/2025/03/21/232835926/induk-usaha-hmsp-komitmen-investasi-jangka-panjang-di-indonesia%3Fpage%3Dall&ved=2ahUKEwiN1IH3s-yQAxURTWwGHW5SOhAQxfQBegQIBBAC&usg=AOvVaw1CwTalnXJrh_VPeaxQ1xWU",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "HMSP Indonesia has reaffirmed its commitment to long-term investments in Indonesia, signaling a positive outlook for the company. This strategy may enhance its competitive position and profitability in the market.",
      "sentiment": "positive",
      "sentiment_confidence": 0.85,
      "fetched_at": "2025-11-12T10:30:16.132697+00:00"
    },
    {
      "title": "Siapa Pemegang Saham Mayoritas HMSP? Ini Jawabannya",
      "link": "https://www.rctiplus.com/news/detail/inews/5234782/siapa-pemegang-saham-mayoritas-hmsp--ini-jawabannya&ved=2ahUKEwiN1IH3s-yQAxURTWwGHW5SOhAQxfQBegQIChAC&usg=AOvVaw3mgeZ6Ank4aVYC6IpMcL5o",
      "snippet": "",
      "date": "",
      "published_at": "",
      "raw_date": "",
      "source": "",
      "summary": "HMSP, a major Indonesian tobacco producer, is predominantly owned by Philip Morris International, which acquired a 97% stake in 2005. The company has a strong financial history and operates several subsidiaries in various sectors, including tobacco distribution and management consulting. This ownership structure reinforces HMSP's market position but also ties its performance closely to Philip Morris's global strategies.",
      "sentiment": "positive",
      "sentiment_confidence": 0.8,
      "fetched_at": "2025-11-12T10:30:16.132697+00:00"
    }
  ]
}